In [119]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [120]:
df = pd.read_csv('/Users/delinaivanova/Library/CloudStorage/OneDrive-Personal/UoT/Micro Courses/Data Science/3250 B/Module 1/MessyData.csv')

In [121]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [122]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     object
 6   Income         26 non-null     float64
 7   CreditLimit    30 non-null     object
 8   MaritalStatus  24 non-null     object
dtypes: float64(1), object(8)
memory usage: 2.2+ KB

In [123]:
# count the total number of missing values in the data
df.isnull().sum()

Name             0
PhoneNumber      0
City             0
Address          0
PostalCode       0
BirthDate        0
Income           4
CreditLimit      0
MaritalStatus    6
dtype: int64

In [124]:
# count the total number of missing values in the data
df.isnull().sum().sum()

10

In [125]:
# use size to get the total number of data points in a data set
df.size

270

In [126]:
df.shape

(30, 9)

In [127]:
# or use shape to manually calculate total number of data points
df.shape[0] * df.shape[1]

270

In [128]:
# calculate the % of missing data
df.isnull().sum().sum()/df.size

0.037037037037037035

In [129]:
# calculate the % of missing data by column
df.isnull().sum()/df.shape[0]

Name             0.000000
PhoneNumber      0.000000
City             0.000000
Address          0.000000
PostalCode       0.000000
BirthDate        0.000000
Income           0.133333
CreditLimit      0.000000
MaritalStatus    0.200000
dtype: float64

In [130]:
df.shape

(30, 9)

In [131]:
# simulate what would happen if we drop missing data
df.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 0 to 28
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           21 non-null     object
 1   PhoneNumber    21 non-null     object
 2   City           21 non-null     object
 3   Address        21 non-null     object
 4   PostalCode     21 non-null     object
 5   BirthDate      21 non-null     object
 6   Income         21 non-null     float64
 7   CreditLimit    21 non-null     object
 8   MaritalStatus  21 non-null     object
dtypes: float64(1), object(8)
memory usage: 1.6+ KB

In [132]:
# use string method to check for alphabetical data points within a column
df[df['CreditLimit'].str.isalpha()]

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [133]:
# we could directly replace the value using replace()
df2 = df.copy()

In [134]:
df2['CreditLimit'] = df2['CreditLimit'].replace('high',np.nan)

In [135]:
df2.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [136]:
# the other way to replace wrong data types is to force-convert to numeric
df['CreditLimit'] = pd.to_numeric(df['CreditLimit'], errors='coerce')

In [137]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [138]:
# convert birthday column from object to datetime data type
df['BirthDate'] = pd.to_datetime(df['BirthDate'])

/var/folders/75/tr_v06ms4k7gy38vcppxbcf80000gn/T/ipykernel_29978/2124381247.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [139]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         26 non-null     float64
 7   CreditLimit    29 non-null     float64
 8   MaritalStatus  24 non-null     object
dtypes: datetime64[ns](1), float64(2), object(6)
memory usage: 2.2+ KB

In [140]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,2052-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [141]:
check_years = []
greater_than_2024 = []
for i in df['BirthDate']:
    check_years.append(i.year)
    if i.year > 2024:
        greater_than_2024.append(i)

In [142]:
check_years.sort()
print(min(check_years), max(check_years))

1974 2068

In [143]:
greater_than_2024

[Timestamp('2052-05-02 00:00:00'),
 Timestamp('2062-03-15 00:00:00'),
 Timestamp('2068-07-25 00:00:00'),
 Timestamp('2062-01-24 00:00:00'),
 Timestamp('2056-11-03 00:00:00'),
 Timestamp('2058-02-27 00:00:00'),
 Timestamp('2065-07-31 00:00:00'),
 Timestamp('2058-03-23 00:00:00')]

In [144]:
import datetime

In [145]:
datetime.datetime.today().year

2024

In [146]:
def fix_date(x):
    if x.year > datetime.datetime.today().year:
        year = x.year - 100
    else:
        year = x.year
    return datetime.date(year, x.month, x.day)

In [147]:
df['BirthDate'] = df['BirthDate'].apply(fix_date)

In [148]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [149]:
df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [150]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         26 non-null     float64
 7   CreditLimit    29 non-null     float64
 8   MaritalStatus  24 non-null     object
dtypes: datetime64[ns](1), float64(2), object(6)
memory usage: 2.2+ KB

In [152]:
# anytime you're working with categorical data, check the unique values to see if any spelling mistakes and also for a sense of what data is available
sorted(df['City'].unique())

['Charlottetown',
 'Charlotttetownn',
 'Ottawa',
 'Ottawas',
 'Toronot',
 'Toronto',
 'Winnipeg',
 'Winnipegg',
 'Yellowknife']

In [153]:
df['MaritalStatus'].unique()

array(['Single', 'Divorced', 'Married', nan], dtype=object)

In [154]:
# we can use the replace function to replace mistakes
df['City'] = df['City'].replace('Charlotttetownn', 'Charlottetown')

In [155]:
sorted(df['City'].unique())

['Charlottetown',
 'Ottawa',
 'Ottawas',
 'Toronot',
 'Toronto',
 'Winnipeg',
 'Winnipegg',
 'Yellowknife']

In [156]:
# instead of using replace, we can use map()
# when using map() you need to include everything, even the correct spellings
corrections_dict = {'Ottawa':'Ottawa',
                    'Ottawas':'Ottawa',
                    'Toronot':'Toronto',
                    'Toronto':'Toronto',
                    'Winnipeg':'Winnipeg',
                    'Winnipegg':'Winnipeg',
                    'Yellowknife':'Yellowknife',
                    'Charlottetown':'Charlottetown'}

In [157]:
df['City'] = df['City'].map(corrections_dict)

In [158]:
df.City.unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown', 'Toronto'],
      dtype=object)

In [175]:
df['Contact'] = df[['BirthDate']].applymap(lambda x: 'Contact' if x.year > 1995 else 'Do not contact')

In [177]:
df['BirthYear'] = df['BirthDate'].apply(lambda x: x.year)

In [178]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,BirthYear,Contact
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,1987,Do not contact
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,1991,Do not contact
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married,1952,Do not contact
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,1981,Do not contact
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN,2001,Contact

In [186]:
# now we can analyze the missing data and see if there are any patterns

df.groupby('City').apply(lambda x: x.isnull().sum())

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,BirthYear,Contact
City,,,,,,,,,,,
Charlottetown,0,0,0,0,0,0,2,1,3,0,0
Ottawa,0,0,0,0,0,0,1,0,3,0,0
Toronto,0,0,0,0,0,0,1,0,0,0,0
Winnipeg,0,0,0,0,0,0,0,0,0,0,0
Yellowknife,0,0,0,0,0,0,0,0,0,0,0